**How to join (merge) data frames (inner, outer, right, left join) in pandas

1.   List item
2.   List item

python**


---



```
We can merge two data frames in pandas python by using the merge() function. The different arguments to merge() allow you to perform natural join,  left join, right join, and full outer join in pandas.
```

1.  left− Dataframe1.

2.  right– Dataframe2.

3.  on− Columns (names) to join on. Must be found in both the left and right DataFrame objects.

4.  how – type of join needs to be performed – ‘left’, ‘right’, ‘outer’, ‘inner’, Default is inner join



---

The data frames must have same column names on which the merging happens. Merge() Function in pandas is similar to database join operation in SQL.


**UNDERSTANDING THE DIFFERENT TYPES OF MERGE:**

1 . Natural join: To keep only rows that match from the data frames, specify the argument how=‘inner’.

2 . Full outer join:To keep all rows from both data frames, specify how=‘outer’.

3 . Left outer join:To include all the rows of your data frame x and only those from y that match, specify how=‘left’.

4 . Right outer join:To include all the rows of your data frame y and only those from x that match, specify how=‘right’.


![alt text](http://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png)


<img src = "https://learnsql.com/blog/learn-and-practice-sql-joins/2.png">

In [2]:
import pandas as pd
import numpy as np

# data frame 1
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
  'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television'])}
df1 = pd.DataFrame(d1)

# data frame 2
d2 = {'Customer_id':pd.Series([2,4,6]),
    'State':pd.Series(['California','California','Texas'])}
df2 = pd.DataFrame(d2)

In [3]:

df1

   Customer_id     Product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

In [4]:

df2

   Customer_id       State
0            2  California
1            4  California
2            6       Texas

# Inner: intersection only

In [6]:
pd.merge(left= df1, right = df2, on = 'Customer_id', how = 'inner')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [8]:
# Changing the positions
pd.merge(left = df2, right = df1, on = 'Customer_id', how = 'inner')

   Customer_id       State     Product
0            2  California        Oven
1            4  California  Television
2            6       Texas  Television

# Outer join : Union

*Outer join pandas: Returns all rows from both tables, join records from the left which have matching keys in the right table.*

In [9]:
pd.merge(left = df1, right = df2, on = 'Customer_id', how = 'outer')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [10]:
# Changing the positions
pd.merge(left = df2, right = df1, on = 'Customer_id', how = 'outer')

   Customer_id       State     Product
0            2  California        Oven
1            4  California  Television
2            6       Texas  Television
3            1         NaN        Oven
4            3         NaN        Oven
5            5         NaN  Television

# Left : Left table ko sabai data regardless of the right table

*Left outer join pandas: Return all rows from the left table, and any rows with matching keys from the right table.*

In [11]:
pd.merge(left = df1, right = df2, on = 'Customer_id', how = 'left')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

# Right: right table o sabai data regardless of the left table

*Right outer join pandas: Return all rows from the right table, and any rows with matching keys from the left table.*

In [12]:
pd.merge(left = df1, right = df2, on = 'Customer_id', how = 'right')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas